package com.denknd.validator;

import java.util.List;

/**
 * Используется для валидации региона.
 */
public class RegionValidator implements Validator {
  /**
   * Все регионы России.
   */
  private final List<String> regions = List.of(
          "Республика Адыгея",
          "Адыгея",
          "Республика Алтай",
          "Алтай",
          "Республика Башкортостан",
          "Башкортостан",
          "Республика Бурятия",
          "Бурятия",
          "Республика Дагестан", "Дагестан",
          "Республика Ингушетия",
          "Ингушетия",
          "Кабардино-Балкарская Республика",
          "Республика Калмыкия",
          "Калмыкия",
          "Республика Карачаево-Черкесия",
          "Карачаево-Черкесия",
          "Республика Карелия",
          "Карелия",
          "Республика Коми",
          "Коми",
          "Республика Марий Эл",
          "Марий Эл",
          "Республика Мордовия",
          "Мордовия",
          "Республика Саха",
          "Саха",
          "Якутия",
          "Республика Северная Осетия",
          "Северная Осетия",
          "Алания",
          "Республика Татарстан",
          "Татарстан",
          "Республика Тыва",
          "Тыва",
          "Удмуртская Республика",
          "Республика Хакасия",
          "Хакасия",
          "Чеченская Республика",
          "Чувашская Республика",
          "Алтайский край",
          "Краснодарский край",
          "Красноярский край",
          "Приморский край",
          "Ставропольский край",
          "Хабаровский край",
          "Амурская область",
          "Архангельская область",
          "Астраханская область",
          "Белгородская область",
          "Брянская область",
          "Владимирская область",
          "Волгоградская область",
          "Вологодская область",
          "Воронежская область",
          "Ивановская область",
          "Иркутская область",
          "Калининградская область",
          "Калужская область",
          "Камчатский край",
          "Кемеровская область",
          "Кировская область",
          "Костромская область",
          "Курганская область",
          "Курская область",
          "Ленинградская область",
          "Липецкая область",
          "Магаданская область",
          "Московская область",
          "Мурманская область",
          "Нижегородская область",
          "Новгородская область",
          "Новосибирская область",
          "Омская область",
          "Оренбургская область",
          "Орловская область",
          "Пензенская область",
          "Пермский край",
          "Псковская область",
          "Ростовская область",
          "Рязанская область",
          "Самарская область",
          "Саратовская область",
          "Сахалинская область",
          "Свердловская область",
          "Смоленская область",
          "Тамбовская область",
          "Тверская область",
          "Томская область",
          "Тульская область",
          "Тюменская область",
          "Ульяновская область",
          "Челябинская область",
          "Забайкальский край",
          "Ярославская область",
          "г. Москва",
          "Москва",
          "г. Санкт-Петербург",
          "Санкт-Петербург",
          "Еврейская автономная область",
          "Ненецкий автономный округ",
          "Ханты-Мансийский автономный округ",
          "Югра",
          "Чукотский автономный округ",
          "Ямало-Ненецкий автономный округ",
          "ЯНАО"
  );

  /**
   * Возвращает тип к которому будет применён данный валидатор.
   *
   * @return возвращает тип валидатора
   */
  @Override
  public String nameValidator() {
    return Validator.REGION_TYPE;
  }

  /**
   * Проверяет входящую строку на валидность.
   *
   * @param value строка для проверки
   * @return true если проверка прошла успешно
   */
  @Override
  public boolean isValid(String value) {
    return this.regions.stream().anyMatch(region -> region.equalsIgnoreCase(value));
  }
}
